Tekla Open API Reference for Tekla Structures 2025
PourMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.PourMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
Class
Returns the class property element type.
Material
Returns the material property element type.
Name
Returns the name property element type.
PourConcreteMixture
Returns the contrete mixture property element type.
PourNumber
Returns the pour number property element type.
PourType
Returns the pour type property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.PourMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace